archived_old_versions/gaganyaan_openfoam_staged_research_v2/gaganyaan_openfoam_staged_research_v2/cases/05_main_full/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| OpenFOAM blockMeshDict: staged projected parachute canopy case              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale 1;
vertices
(
    (-200 -200 0)
    (-200 -200 1)
    (-200 -12.5 0)
    (-200 -12.5 1)
    (-200 12.5 0)
    (-200 12.5 1)
    (-200 200 0)
    (-200 200 1)
    (0 -200 0)
    (0 -200 1)
    (0 -12.5 0)
    (0 -12.5 1)
    (0 12.5 0)
    (0 12.5 1)
    (0 200 0)
    (0 200 1)
    (0.75 -200 0)
    (0.75 -200 1)
    (0.75 -12.5 0)
    (0.75 -12.5 1)
    (0.75 12.5 0)
    (0.75 12.5 1)
    (0.75 200 0)
    (0.75 200 1)
    (500 -200 0)
    (500 -200 1)
    (500 -12.5 0)
    (500 -12.5 1)
    (500 12.5 0)
    (500 12.5 1)
    (500 200 0)
    (500 200 1)
);
blocks
(
    hex (0 8 10 2 1 9 11 3) (70 45 1) simpleGrading (1 1 1)
    hex (2 10 12 4 3 11 13 5) (70 60 1) simpleGrading (1 1 1)
    hex (4 12 14 6 5 13 15 7) (70 45 1) simpleGrading (1 1 1)
    hex (8 16 18 10 9 17 19 11) (8 45 1) simpleGrading (1 1 1)
    hex (12 20 22 14 13 21 23 15) (8 45 1) simpleGrading (1 1 1)
    hex (16 24 26 18 17 25 27 19) (150 45 1) simpleGrading (1 1 1)
    hex (18 26 28 20 19 27 29 21) (150 60 1) simpleGrading (1 1 1)
    hex (20 28 30 22 21 29 31 23) (150 45 1) simpleGrading (1 1 1)
);
edges (); 
boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 0 2 3 1 )
            ( 2 4 5 3 )
            ( 4 6 7 5 )
        );
    }
    outlet
    {
        type patch;
        faces
        (
            ( 24 25 27 26 )
            ( 26 27 29 28 )
            ( 28 29 31 30 )
        );
    }
    farfield
    {
        type patch;
        faces
        (
            ( 0 8 9 1 )
            ( 8 16 17 9 )
            ( 16 24 25 17 )
            ( 6 7 15 14 )
            ( 14 15 23 22 )
            ( 22 23 31 30 )
        );
    }
    canopy
    {
        type wall;
        faces
        (
            ( 10 11 13 12 )
            ( 18 20 21 19 )
            ( 10 18 19 11 )
            ( 12 13 21 20 )
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            ( 0 8 10 2 )
            ( 1 3 11 9 )
            ( 2 10 12 4 )
            ( 3 5 13 11 )
            ( 4 12 14 6 )
            ( 5 7 15 13 )
            ( 8 16 18 10 )
            ( 9 11 19 17 )
            ( 12 20 22 14 )
            ( 13 15 23 21 )
            ( 16 24 26 18 )
            ( 17 19 27 25 )
            ( 18 26 28 20 )
            ( 19 21 29 27 )
            ( 20 28 30 22 )
            ( 21 23 31 29 )
        );
    }
);
mergePatchPairs (); 
