archived_old_versions/gaganyaan_openfoam_staged_research_v2/gaganyaan_openfoam_staged_research_v2/cases/05_main_full/system/fvConstraints
FoamFile
{ version 2.0; format ascii; class dictionary; object fvConstraints; }
